Revision of all pandas concept learned

In [102]:
import pandas as pd

In [103]:
# Create your own data frame
students = {
    'id' : [1,2,3,4,5,6],
    'first' : ['Rabin', 'Sabin', 'Prabin', 'Harbin', 'Damin', 'Ramin'],
    'last' : ['Karki', 'Sarki', 'Tharki', 'Darki', 'Narki', 'Parki'],
    'email': ['rabinkarki11@gmail.com', 'sabinsarki234@gmail.com', 'tharkiprabin345@gmail.com', 
                'darkiharbin456@gmail.com', 'narkidamin789@gmail.com', 'raminparki348@gmail.com'],
    'GPA' : [3.44, 3.89, 2.90, 4.00, 3.19, 4.00]
}
df = pd.DataFrame(students)
df

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

In [104]:
df.columns

Index(['id', 'first', 'last', 'email', 'GPA'], dtype='object')

In [105]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [106]:
df.head()

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19

In [107]:
df.tail()

   id   first    last                      email   GPA
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

In [108]:
df.shape # size of the dataframe

(6, 5)

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int64
 1   first   6 non-null      object
 2   last    6 non-null      object
 3   email   6 non-null      object
 4   GPA     6 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [110]:
df.describe()

             id       GPA
count  6.000000  6.000000
mean   3.500000  3.570000
std    1.870829  0.465274
min    1.000000  2.900000
25%    2.250000  3.252500
50%    3.500000  3.665000
75%    4.750000  3.972500
max    6.000000  4.000000

Lesson two revision

In [111]:
df['first'] # Accessing a column

0     Rabin
1     Sabin
2    Prabin
3    Harbin
4     Damin
5     Ramin
Name: first, dtype: object

In [112]:
df.email

0       rabinkarki11@gmail.com
1      sabinsarki234@gmail.com
2    tharkiprabin345@gmail.com
3     darkiharbin456@gmail.com
4      narkidamin789@gmail.com
5      raminparki348@gmail.com
Name: email, dtype: object

In [113]:
df[['last', 'first']]

     last   first
0   Karki   Rabin
1   Sarki   Sabin
2  Tharki  Prabin
3   Darki  Harbin
4   Narki   Damin
5   Parki   Ramin

In [114]:
type(df[['last', 'first']])

pandas.core.frame.DataFrame

In [115]:
df.columns

Index(['id', 'first', 'last', 'email', 'GPA'], dtype='object')

In [116]:
df.iloc[0] # first row

id                            1
first                     Rabin
last                      Karki
email    rabinkarki11@gmail.com
GPA                        3.44
Name: 0, dtype: object

In [117]:
# multiple rows
df.iloc[[0,1]]

   id  first   last                    email   GPA
0   1  Rabin  Karki   rabinkarki11@gmail.com  3.44
1   2  Sabin  Sarki  sabinsarki234@gmail.com  3.89

In [118]:
df.iloc[[0,3], [0,2,3]] # iloc[[rows], [cols]]

   id   last                     email
0   1  Karki    rabinkarki11@gmail.com
3   4  Darki  darkiharbin456@gmail.com

In [119]:
# Slicing
df.iloc[0:2, 0:2]

   id  first
0   1  Rabin
1   2  Sabin

Lesson three revision

In [120]:
# The day is all about indexes
df.set_index('id', inplace=True)
df

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
4   Harbin   Darki   darkiharbin456@gmail.com  4.00
5    Damin   Narki    narkidamin789@gmail.com  3.19
6    Ramin   Parki    raminparki348@gmail.com  4.00

In [121]:
df.loc[1:5:2]

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
5    Damin   Narki    narkidamin789@gmail.com  3.19

In [122]:
df.loc[1:3]

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90

In [123]:
df.loc[::-1]

     first    last                      email   GPA
id
6    Ramin   Parki    raminparki348@gmail.com  4.00
5    Damin   Narki    narkidamin789@gmail.com  3.19
4   Harbin   Darki   darkiharbin456@gmail.com  4.00
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
1    Rabin   Karki     rabinkarki11@gmail.com  3.44

In [124]:
df.index

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64', name='id')

In [125]:
df.iloc[0:2, 0:2] # slicing with iloc

    first   last
id
1   Rabin  Karki
2   Sabin  Sarki

In [126]:
# To reset index
df.reset_index() # inplace to make it premanent

   id   first    last                      email   GPA
0   1   Rabin   Karki     rabinkarki11@gmail.com  3.44
1   2   Sabin   Sarki    sabinsarki234@gmail.com  3.89
2   3  Prabin  Tharki  tharkiprabin345@gmail.com  2.90
3   4  Harbin   Darki   darkiharbin456@gmail.com  4.00
4   5   Damin   Narki    narkidamin789@gmail.com  3.19
5   6   Ramin   Parki    raminparki348@gmail.com  4.00

Revision of Data Filtering

In [127]:
gpaFilt = (df['GPA'] < 4.0) # series with bool values, it corresponds with DF
df[gpaFilt] # a filter mask on the dataframe

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
5    Damin   Narki    narkidamin789@gmail.com  3.19

In [128]:
df.loc[gpaFilt]

     first    last                      email   GPA
id
1    Rabin   Karki     rabinkarki11@gmail.com  3.44
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
5    Damin   Narki    narkidamin789@gmail.com  3.19

In [129]:
df.loc[gpaFilt, ['last', 'email']] # pass the columns in the filter

      last                      email
id
1    Karki     rabinkarki11@gmail.com
2    Sarki    sabinsarki234@gmail.com
3   Tharki  tharkiprabin345@gmail.com
5    Narki    narkidamin789@gmail.com

In [130]:
# AND &
fil2 = (df['GPA'] > 2.5 ) & (df['last'] == 'Karki')
df.loc[fil2]

    first   last                   email   GPA
id
1   Rabin  Karki  rabinkarki11@gmail.com  3.44

In [131]:
# Inverting a filter
df.loc[~fil2]

     first    last                      email   GPA
id
2    Sabin   Sarki    sabinsarki234@gmail.com  3.89
3   Prabin  Tharki  tharkiprabin345@gmail.com  2.90
4   Harbin   Darki   darkiharbin456@gmail.com  4.00
5    Damin   Narki    narkidamin789@gmail.com  3.19
6    Ramin   Parki    raminparki348@gmail.com  4.00

In [132]:
# You could use a list to find permissible values in a column
# Keep the names of a column in a list
# values = [val1, val2, val3, ... , valn]
# cols = [col1, col2, col3, ..., coln]
# filt = df['Val'].isin(values)
# df.loc[filt, cols]

In [133]:
# Revision of lesson 5 
# updating rows and columns
df.columns

Index(['first', 'last', 'email', 'GPA'], dtype='object')

In [134]:
# renaming all columns
df.columns = ['firstName', 'lastName', 'emailAddress', 'CGPA']
df

   firstName lastName               emailAddress  CGPA
id
1      Rabin    Karki     rabinkarki11@gmail.com  3.44
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90
4     Harbin    Darki   darkiharbin456@gmail.com  4.00
5      Damin    Narki    narkidamin789@gmail.com  3.19
6      Ramin    Parki    raminparki348@gmail.com  4.00

In [135]:
# renaming only selected columns
df.rename(columns={'emailAddress' : 'email', 'CGPA': 'GPA'}, inplace=True)
df

   firstName lastName                      email   GPA
id
1      Rabin    Karki     rabinkarki11@gmail.com  3.44
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90
4     Harbin    Darki   darkiharbin456@gmail.com  4.00
5      Damin    Narki    narkidamin789@gmail.com  3.19
6      Ramin    Parki    raminparki348@gmail.com  4.00

In [136]:
# Updating rows
df.loc[1] = ['Babin', 'Dabin', 'dabinbabin89@gmail.com', 3.19]
df

   firstName lastName                      email   GPA
id
1      Babin    Dabin     dabinbabin89@gmail.com  3.19
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90
4     Harbin    Darki   darkiharbin456@gmail.com  4.00
5      Damin    Narki    narkidamin789@gmail.com  3.19
6      Ramin    Parki    raminparki348@gmail.com  4.00

In [137]:
# update only a subset of columns
df.loc[3, ['lastName', 'firstName']] = ['Danker', 'Manker']
df

   firstName lastName                      email   GPA
id
1      Babin    Dabin     dabinbabin89@gmail.com  3.19
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89
3     Manker   Danker  tharkiprabin345@gmail.com  2.90
4     Harbin    Darki   darkiharbin456@gmail.com  4.00
5      Damin    Narki    narkidamin789@gmail.com  3.19
6      Ramin    Parki    raminparki348@gmail.com  4.00

In [138]:
# using at() method
df.at[3, ['lastName', 'firstName']] = ['Tharki', 'Prabin']
df

   firstName lastName                      email   GPA
id
1      Babin    Dabin     dabinbabin89@gmail.com  3.19
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90
4     Harbin    Darki   darkiharbin456@gmail.com  4.00
5      Damin    Narki    narkidamin789@gmail.com  3.19
6      Ramin    Parki    raminparki348@gmail.com  4.00

In [139]:
# using filtering technique
filt = (df['lastName'] == 'Parki')
df.loc[filt, ['lastName', 'email']] = ['Basnet', 'raminbasnet348@gmail.com']
df

   firstName lastName                      email   GPA
id
1      Babin    Dabin     dabinbabin89@gmail.com  3.19
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90
4     Harbin    Darki   darkiharbin456@gmail.com  4.00
5      Damin    Narki    narkidamin789@gmail.com  3.19
6      Ramin   Basnet   raminbasnet348@gmail.com  4.00

In [140]:
# updating multiple rows
# Must learn methods : apply(), map(), applymap(), replace()

#  1. apply() : used for row/column wise operation
# apply() : for series apply() runs for each value while for DF it runs on each row or column
df.apply(len) # no. of rows for each column
df.apply(len, axis='columns') # no of columns for each row

# The question is what if the DF has null values?

id
1    4
2    4
3    4
4    4
5    4
6    4
dtype: int64

In [141]:
# apply on DF works by applying fn on every series on DF
df.apply(pd.Series.min)

firstName                     Babin
lastName                     Basnet
email        dabinbabin89@gmail.com
GPA                             2.9
dtype: object

In [142]:
df.apply(lambda x : x.min())

firstName                     Babin
lastName                     Basnet
email        dabinbabin89@gmail.com
GPA                             2.9
dtype: object

In [143]:
# 2. Applymap : use apply on each value of dataframe. Works only with dataframe
# i.e. apply function element-wise on each cell of the dataframe
df.applymap(lambda x : str(x).upper()) # convert cell to string and make it uppercase

   firstName lastName                      email   GPA
id
1      BABIN    DABIN     DABINBABIN89@GMAIL.COM  3.19
2      SABIN    SARKI    SABINSARKI234@GMAIL.COM  3.89
3     PRABIN   THARKI  THARKIPRABIN345@GMAIL.COM   2.9
4     HARBIN    DARKI   DARKIHARBIN456@GMAIL.COM   4.0
5      DAMIN    NARKI    NARKIDAMIN789@GMAIL.COM  3.19
6      RAMIN   BASNET   RAMINBASNET348@GMAIL.COM   4.0

In [144]:
# 3. map : used to apply function element-wise, but only on single series
# (i.e. one column, not a whole dataframe)
def grademap(gpa):
    if gpa <= 2.0:
        return 'C'
    elif gpa <= 3.0:
        return 'B'
    else:
        return 'A'

df['Grade'] = df['GPA'].map(grademap)
df

   firstName lastName                      email   GPA Grade
id
1      Babin    Dabin     dabinbabin89@gmail.com  3.19     A
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89     A
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90     B
4     Harbin    Darki   darkiharbin456@gmail.com  4.00     A
5      Damin    Narki    narkidamin789@gmail.com  3.19     A
6      Ramin   Basnet   raminbasnet348@gmail.com  4.00     A

| Operation            | Method        | Scope       |
| -------------------- | ------------- | ----------- |
| Element-wise (1 col) | `.map()`      | Series only |
| Column- or row-wise  | `.apply()`    | DataFrame   |
| Cell-wise            | `.applymap()` | DataFrame   |

In [145]:
# use replace() if the map is incomplete 
df['firstName'] = df['firstName'].replace({'Harbin' : 'Darwin'})
df

   firstName lastName                      email   GPA Grade
id
1      Babin    Dabin     dabinbabin89@gmail.com  3.19     A
2      Sabin    Sarki    sabinsarki234@gmail.com  3.89     A
3     Prabin   Tharki  tharkiprabin345@gmail.com  2.90     B
4     Darwin    Darki   darkiharbin456@gmail.com  4.00     A
5      Damin    Narki    narkidamin789@gmail.com  3.19     A
6      Ramin   Basnet   raminbasnet348@gmail.com  4.00     A